# Configuration de la connexion à la base de données

In [1]:
import pandas as pd 
import cx_Oracle
import sys
import os

%pylab inline
%load_ext sql

%pylab is deprecated, use %matplotlib inline and import the required libraries.
Populating the interactive namespace from numpy and matplotlib

In [2]:
sys.path.append(os.path.abspath('../../.'))
from dbconnect import utilisateur,connexion,password

# Connexion

In [3]:
%sql oracle+cx_oracle://$utilisateur:$password@$connexion

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/612.png" width="800">

# Fonctions d’arrondis
## ABS

In [4]:
%sql SELECT ABS(-10),ABS(0),ABS(1) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(10, 0, 1)]

## SIGN

In [5]:
%sql SELECT SIGN(-10),SIGN(0),SIGN(20) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(-1, 0, 1)]

## CEIL

In [6]:
%sql SELECT CEIL(-10.23),CEIL(0),CEIL(20.23) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(-10, 0, 21)]

## FLOOR

In [7]:
%sql SELECT FLOOR(-10.23),FLOOR(0),FLOOR(20.23) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(-11, 0, 20)]

## ROUND

In [8]:
%sql SELECT ROUND(-10.2326,2),ROUND(10.2366,3),ROUND(-10.2326) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('-10.23'), Decimal('10.237'), -10)]

In [9]:
%sql SELECT ROUND(102356,-2),ROUND(102326,-3),ROUND(102326) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(102400, 102000, 102326)]

In [10]:
%sql SELECT ROUND(-10.2326,2),ROUND(10.2366,3),ROUND(-10.2326) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('-10.23'), Decimal('10.237'), -10)]

## TRUNC

In [11]:
%sql SELECT TRUNC(10.2326,2),TRUNC(10.2376,2), TRUNC(102826,-3),TRUNC(10.2326) FROM DUAL

 * oracle+cx_oracle://stagiaire:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('10.23'), Decimal('10.23'), 102000, 10)]

# Atelier 4.2	Les fonctions numériques
Écrivez les requêtes vous permettant d’afficher :

>> * Les employés et leur salaire journalier (salaire / 20) arrondi à l’entier inférieur.
>> * Les employés et leur salaire journalier (salaire / 20) arrondi à l’entier supérieur.
>> * Les produits commercialisés, la valeur du stock, les unités en stock fois le prix unitaire, arrondie à la centaine près.
>> * Les produits commercialisés, la valeur du stock, les unités en stock fois le prix unitaire, arrondie à la dizaine inférieure.
>> * Les employés et leur revenu annuel (salaire*12 + commission) arrondi à la centaine près.